Dlubal.DynamPro.ResponseSpectraType
Response spectra definition type - only RS_USER_DEFINED is being available through COM

Dlubal.DynamPro.ResponseSpectraType.UnknownResponseSpectraType
Unknown type

Dlubal.DynamPro.ResponseSpectraType.1
Unknown type

Dlubal.DynamPro.ResponseSpectraType.AccordingToStandard
According to national standard/annex

Dlubal.DynamPro.ResponseSpectraType.UserDefinedRS
User-defined Response Spectrum

Dlubal.DynamPro.ResponseSpectraType.FromAccelerogramRS
Generate from acceleration